app/controllers/posts_controller.rb

  def index
  @authors = Author.all

  if !params[:author].blank?
<<<<<<< HEAD
    @posts = Post.by_author(params[:author])
  elsif !params[:date].blank?
    if params[:date] == "Today"
      @posts = Post.from_today
    else
      @posts = Post.old_news
=======
    @posts = Post.by_author(params[:author]))
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')